<?php

return [
    'no_solution' => 'Задача не имеет решения. На использование заданных бюджетов не хватает средств. Добавьте реальные бюджеты',
    'refresh_priority' => 'Обновите значения приоритетов Целей',
    'kpi' => [
        'created' => 'Цель :name была создана',
        'updated' => 'Цель :name была обновлена',
        'deleted' => 'Цель :name была удалена',
        'cant_delete' => 'Цель :name не может быть удалена',
    ],
    'budget' => [
        'created' => 'Сегмент :budget подразделения :subdivision был создан',
        'updated' => 'Сегмент :budget подразделения :subdivision был обновлен',
        'deleted' => 'Сегмент :budget подразделения :subdivision был удален',
        'duplicated' => 'Сегмент :budget подразделения :subdivision был дублирован',
        'cant_delete' => 'Сегмент :budget подразделения :subdivision не может быть удален',
    ],
    'subdivision' => [
        'created' => 'Подразделение :name было создано',
        'updated' => 'Подразделение :name было обновлено',
        'deleted' => 'Подразделение :name было удалено',
        'cant_delete' => 'Подразделение :name не может быть удалено',
    ],
    'budget_indicator' => [
        'created' => 'Статья бюджета :name была создана',
        'updated' => 'Статья бюджета :name была обновлена',
        'deleted' => 'Статья бюджета :name была удалена',
        'cant_delete' => 'Статья бюджета :name не может быть удалена',
    ],
    'experiment' => [
        'created' => 'Експеримент :name был создан',
        'updated' => 'Експеримент :name был обновлен',
        'deleted' => 'Експеремент :name был удален',
        'cant_delete' => 'Експеримент :name не может быть удален',
    ],
    'saved' => 'Изменения сохранены',
    'at_least_1_budget' => 'Каждое подразделение должно иметь хотябы 1 сегмент',
];